class Schedule:
    def __init__(self):
        self.__schedule: dict = {
            0: {
                0: 'история',
                1: 'обществознание',
                2: 'литература',
                3: 'математика',
                4: 'информатика/англ.яз',
            },
            1: {
                0: 'физическая культура',
                1: 'физическая культура',
                2: 'обж',
                3: 'математика',
                4: 'физика',
                5: 'математика',
                6: 'английский язык',
            },
            2: {
                0: 'история',
                1: 'обществознание',
                2: 'литература',
                3: 'литература',
                4: 'английский язык',
            },
            3: {
                0: 'проектная деятельность',
                1: 'химия',
                2: 'физическая культура',
                3: 'математика',
                4: 'математика',
                5: 'география',
                6: 'англ.яз/информатика',
            },
            4: {
                0: 'физика',
                1: 'астрономия',
                2: 'биология',
                3: 'история',
                4: 'русский язык',
                5: 'русский язык',
            },
        }

    def getSchedule(self) -> dict:
        return self.__schedule

    @staticmethod
    def getTime(lessonNum: int) -> str:
        match lessonNum:
            case 0: return '9:00 - 9:45'
            case 1: return '9:55 - 10:40'
            case 2: return '11:00 - 11:45'
            case 3: return '12:05 - 12:50'
            case 4: return '13:00 - 13:45'
            case 5: return '14:50 - 15:35'
            case 6: return '15:45 - 16:30'

    @staticmethod
    def getDayName(dayNum: int) -> str:
        match dayNum:
            case 0: return 'Понедельник'
            case 1: return 'Вторник'
            case 2: return 'Среда'
            case 3: return 'Четверг'
            case 4: return 'Пятница'
